{
  "es": {
    "lang_label": "Idioma:",
    "dark_mode": "Modo Oscuro",
    "light_mode": "Modo Claro",
    "name": "Martín González Dios",
    "subtitle": "Ingeniero informático orientado a la ciberseguridad.",
    "about_title": "Acerca de mí",
    "about_p1": "Estudiante de Ingeniería Informática, orientado al campo de la ciberseguridad. Participo activamente en CTFs y hackathons, con experiencia en pruebas de intrusión y desarrollo de exploits básicos. Mi formación es continua, combinando los estudios universitarios con el aprendizaje autodidacta. En la universidad he adquirido conocimientos sólidos en sistemas operativos, redes, bases de datos, APIs y otras materias esenciales que completan la formación de un ingeniero informático. Esto me ha proporcionado una base sólida. Paralelamente, de forma autodidacta profundizo en ciberseguridad y administración de redes mediante plataformas como Hack The Box o a través de diversas certificaciones técnicas.",
    "about_p2": "Soy un apasionado del open source; la mayoría de las herramientas que utilizo a diario son FOSS. Trabajo principalmente con Arch Linux en mi entorno de desarrollo y empleo Debian para servidores. Mi editor de código predilecto es Neovim, es el que más uso y en el que más cómodo me siento.",
    "education_title": "Educación",
    "education_highschool": "Bachillerato de Ciencias",
    "education_highschool_place": "IES Frei Martín Sarmiento e IES Xunqueira I (2021-2023)",
    "education_degree": "Grado en Ingeniería Informática",
    "education_degree_place": "Universidad de Santiago de Compostela (2023-presente)",
    "certifications_title": "Certificaciones",
    "cert_lpic1_desc": "desde que comencé mi carrera, Linux ha sido siempre fundamental para mí; es el sistema operativo de facto que utilizo desde hace años. Esta fue una de las razones por las que decidí aprenderlo en profundidad, lo que me llevó a preparar y obtener el Linux Professional Institute Certification 1. Gracias a esta certificación, ahondé en tecnologías como systemd, el uso y gestión de distribuciones Red Hat, el hardening de servidores Linux y muchas otras áreas.",
    "cert_ccst_desc": "como resultado de completar esta certificación, adquirí una visión práctica y teórica en ciberseguridad: identificación y evaluación de amenazas, flujos de trabajo de respuesta a incidentes y principios de seguridad de redes. Al ser mi primera certificación, me ayudó a consolidar una base en el campo y me proporcionó mi primer acercamiento a los servicios, dispositivos y configuraciones dentro del ecosistema de Cisco.",
    "cert_ot_title": "Ciberseguridad avanzada en entornos de las tecnologías de la operación",
    "cert_ot_desc": "siempre he estado interesado en la intersección entre el mundo del desarrollo y el mundo industrial, y este curso me permitió aprender cómo hay que proceder a la hora de manejar un entorno industrial actual, con todo lo que conlleva.",
    "projects_title": "Proyectos/Logros",
    "hackudc_title": "Ganadores HackUDC 2025",
    "hackudc_desc": "Mediante un grupo de 3 personas desarrollamos una extensión de Chrome con JavaScript para el reto de InditexTech, quedando ganadores de este reto. En este hackathon reforcé mis habilidades de trabajo en equipo de forma intensiva, así como de liderazgo y de improvisación.",
    "pickture_caption": "Captura de la extensión",
    "github_link": "Ver proyecto en GitHub",
    "eije_title": "Finalistas EIJE 2025 (Encuentro Internacional de Jóvenes Emprendedores)",
    "eije_desc": "Durante una semana realizamos un MVP de una aplicación Android con Kotlin para reseñas de locales sostenibles, creando un pitch y un plan de negocio. Esta experiencia fue muy enriquecedora, ya que desarrollé numerosas habilidades blandas, como la oratoria o la correcta gestión del tiempo.",
    "greendots_caption": "Capturas de la aplicación",
    "greendots_running": "en funcionamiento",
    "capy_title": "Look for the Capy",
    "capy_desc": "Look for the Capy es un juego desarrollado en C++ que utiliza OpenGL 3.3 para crear un terreno 3D procedimental usando ruido de Perlin. El objetivo del juego es encontrar una capibara a lo largo del terreno todas las veces que sea posible. Ten en cuenta que si tardas demasiado en encontrarla, perderás el juego.",
    "capy_caption": "Captura del juego",
    "technologies": "Tecnologías:",
    "og_title": "Martín González Dios - Ingeniero Informático",
    "og_description": "Página web personal de Martín González Dios, ingeniero informático orientado a la ciberseguridad.",
    "alt_photo": "Fotografía de Martín González Dios",
    "alt_linkedin": "Perfil de LinkedIn de Martín González Dios",
    "alt_github": "Repositorio de GitHub de Martín González Dios",
    "alt_email": "Enviar correo electrónico a Martín González Dios",
    "alt_lpic1": "Insignia de certificación LPIC-1",
    "alt_ccst": "Insignia de certificación CCST Cybersecurity",
    "alt_pickture": "Captura de pantalla de la extensión Pickture mostrando su interfaz de usuario",
    "alt_greendots": "Capturas de pantalla de la aplicación móvil GreenDots mostrando sus diferentes funcionalidades",
    "alt_capy": "Captura de pantalla del videojuego Look for the Capy"
  },
  "en": {
    "lang_label": "Language:",
    "dark_mode": "Dark Mode",
    "light_mode": "Light Mode",
    "name": "Martín González Dios",
    "subtitle": "Computer engineer focused on cybersecurity.",
    "about_title": "About me",
    "about_p1": "Computer Engineering student with a focus on cybersecurity. I actively participate in CTFs and hackathons, with experience in penetration testing and basic exploit development. My training is continuous, combining university studies with self-directed learning. At university, I have acquired solid knowledge in operating systems, networks, databases, APIs, and other essential subjects that complete the education of a computer engineer, providing me with a strong foundation. In parallel, through self-study, I enhance my knowledge in cybersecurity and network administration using platforms such as Hack The Box and through various technical certifications.",
    "about_p2": "I am passionate about open source; most of the tools I use daily are FOSS. I primarily work with Arch Linux in my development environment and use Debian for servers. My preferred code editor is Neovim, it's the one I use most and the one I feel most comfortable with.",
    "education_title": "Education",
    "education_highschool": "High School Diploma in Science",
    "education_highschool_place": "IES Frei Martín Sarmiento and IES Xunqueira I (2021-2023)",
    "education_degree": "Bachelor's Degree in Computer Engineering",
    "education_degree_place": "University of Santiago de Compostela (2023-present)",
    "certifications_title": "Certifications",
    "cert_lpic1_desc": "since I began my career, Linux has always been fundamental to me; it is the de facto operating system I have been using for years. This was one of the reasons why I decided to learn it in depth, which led me to prepare for and obtain the Linux Professional Institute Certification 1. Thanks to this certification, I delved deeper into technologies such as systemd, the use and management of Red Hat distributions, Linux server hardening, and many other areas.",
    "cert_ccst_desc": "as a result of completing this certification, I gained a practical and theoretical overview of cybersecurity: threat identification and assessment, incident response workflows, and network security principles. As my first certification, it helped me consolidate a foundation in the field and provided my first exposure to services, devices, and configurations within the Cisco ecosystem.",
    "cert_ot_title": "Advanced cybersecurity in operational technology environments",
    "cert_ot_desc": "I have always been interested in the intersection between the development world and the industrial world, and this course allowed me to learn how to proceed when managing a current industrial environment, with everything that entails.",
    "projects_title": "Projects/Achievements",
    "hackudc_title": "HackUDC 2025 Winners",
    "hackudc_desc": "As part of a three-person team, we developed a Chrome extension using JavaScript for the InditexTech challenge and won the prize. During the hackathon I strengthened my teamwork skills through intensive collaboration, as well as my leadership and improvisation abilities.",
    "pickture_caption": "Screenshot of the extension",
    "github_link": "See project in GitHub",
    "eije_title": "EIJE 2025 Finalists (International Meeting of Young Entrepreneurs)",
    "eije_desc": "As part of a team during a one-week program, we developed an MVP for an Android app in Kotlin for reviews of sustainable local businesses, and prepared a pitch and a business plan. The experience was highly rewarding and helped me develop several soft skills, including public speaking and effective time management.",
    "greendots_caption": "Screenshots of the application",
    "greendots_running": "running",
    "capy_title": "Look for the Capy",
    "capy_desc": "Look for the Capy is a game developed in C++ that uses OpenGL 3.3 to create procedural 3D terrain using Perlin noise. The goal of the game is to find a capybara across the terrain as many times as possible. Keep in mind that if you take too long to find it, you will lose the game.",
    "capy_caption": "Screenshot of the game",
    "technologies": "Technologies:",
    "og_title": "Martín González Dios - Computer Engineer",
    "og_description": "Personal website of Martín González Dios, computer engineer focused on cybersecurity.",
    "alt_photo": "Photograph of Martín González Dios",
    "alt_linkedin": "LinkedIn profile of Martín González Dios",
    "alt_github": "GitHub repository of Martín González Dios",
    "alt_email": "Send email to Martín González Dios",
    "alt_lpic1": "LPIC-1 certification badge",
    "alt_ccst": "CCST Cybersecurity certification badge",
    "alt_pickture": "Screenshot of the Pickture extension showing its user interface",
    "alt_greendots": "Screenshots of the GreenDots mobile application showing its different functionalities",
    "alt_capy": "Screenshot of the Look for the Capy video game"
  },
  "gl": {
    "lang_label": "Idioma:",
    "dark_mode": "Modo Escuro",
    "light_mode": "Modo Claro",
    "name": "Martín González Dios",
    "subtitle": "Enxeñeiro informático orientado á ciberseguridade.",
    "about_title": "Acerca de min",
    "about_p1": "Estudante de Enxeñaría Informática, orientado ao ámbito da ciberseguridade. Participo activamente en CTFs e hackathons, con experiencia en probas de intrusión e desenvolvemento de exploits básicos. A miña formación é continua, combinando os estudos universitarios coa aprendizaxe autodidacta. Na universidade adquirín coñecementos sólidos en sistemas operativos, redes, bases de datos, APIs e outras materias esenciais que completan a formación dun enxeñeiro informático. Isto proporcionoume unha base sólida. En paralelo, de maneira autodidacta afondo na ciberseguridade e na administración de redes mediante plataformas como Hack The Box ou a través de diversas certificacións técnicas.",
    "about_p2": "Son un apasionado do open source; a maioría das ferramentas que utilizo a diario son FOSS. Traballo principalmente con Arch Linux no meu contorno de desenvolvemento e emprego Debian para servidores. O meu editor de código predilecto é Neovim: é o que máis uso e no que me sinto máis cómodo.",
    "education_title": "Educación",
    "education_highschool": "Bacharelato de Ciencias",
    "education_highschool_place": "IES Frei Martín Sarmiento e IES Xunqueira I (2021-2023)",
    "education_degree": "Grao en Enxeñería Informática",
    "education_degree_place": "Universidade de Santiago de Compostela (2023-presente)",
    "certifications_title": "Certificaciones",
    "cert_lpic1_desc": "dende que comecei a miña carreira, Linux foi sempre fundamental para min; é o sistema operativo de facto que utilizo dende hai anos. Esta foi unha das razóns polas que decidín aprendelo en profundidade, o que me levou a prepararme e obter a Linux Professional Institute Certification 1. Grazas a esta certificación, afondei en tecnoloxías como systemd, o uso e a xestión de distribucións Red Hat, o hardening de servidores Linux e moitas outras áreas.",
    "cert_ccst_desc": "como resultado de completar esta certificación, adquirín unha visión práctica e teórica en ciberseguridade: identificación e avaliación de ameazas, fluxos de traballo de resposta a incidentes e principios de seguridade de redes. Ao ser a miña primeira certificación, axudoume a consolidar unha base no campo e proporcionoume o meu primeiro achegamento aos servizos, dispositivos e configuracións dentro do ecosistema de Cisco.",
    "cert_ot_title": "Ciberseguridade avanzada en contornos das tecnoloxías da operación",
    "cert_ot_desc": "sempre estiven interesado na intersección entre o mundo do desenvolvemento de software e o mundo industrial, e este curso permitiume aprender como hai que proceder á hora de manexar un contorno industrial actual, con todo o que implica.",
    "projects_title": "Proxectos/Logros",
    "hackudc_title": "Gañadores HackUDC 2025",
    "hackudc_desc": "Mediante un grupo de 3 persoas desenvolvemos unha extensión de Chrome con JavaScript para o reto de InditexTech, quedando gañadores deste reto. Neste hackathon reforcei as miñas habilidades de traballo en equipo de forma intensiva, así como de liderado e de improvisación.",
    "pickture_caption": "Captura da extensión",
    "github_link": "Ver proxecto en GitHub",
    "eije_title": "Finalistas EIXE 2025 (Encontro Internacional de Xóvenes Emprendedores)",
    "eije_desc": "Durante unha semana realizamos un MVP dunha aplicación Android con Kotlin para reseñas de locais sostibles, creando un pitch e un plan de negocio. Esta experiencia foi moi enriquecedora, xa que desenvolvín numerosas habilidades brandas, como a oratoria ou a correcta xestión do tempo.",
    "greendots_caption": "Capturas da aplicación",
    "greendots_running": "en funcionamento",
    "capy_title": "Look for the Capy",
    "capy_desc": "Look for the Capy é un xogo desenvolvido en C++ que utiliza OpenGL 3.3 para crear un terreo 3D procedimental usando ruído de Perlin. O obxectivo do xogo é atopar unha capibara ao longo do terreo todas as veces que sexa posible. Ten en conta que se tardas demasiado en atopala, perderás o xogo.",
    "capy_caption": "Captura do xogo",
    "technologies": "Tecnoloxías:",
    "og_title": "Martín González Dios - Enxeñeiro Informático",
    "og_description": "Páxina web persoal de Martín González Dios, enxeñeiro informático orientado á ciberseguridade.",
    "alt_photo": "Fotografía de Martín González Dios",
    "alt_linkedin": "Perfil de LinkedIn de Martín González Dios",
    "alt_github": "Repositorio de GitHub de Martín González Dios",
    "alt_email": "Enviar correo electrónico a Martín González Dios",
    "alt_lpic1": "Insignia de certificación LPIC-1",
    "alt_ccst": "Insignia de certificación CCST Cybersecurity",
    "alt_pickture": "Captura de pantalla da extensión Pickture mostrando a súa interface de usuario",
    "alt_greendots": "Capturas de pantalla da aplicación móbil GreenDots mostrando as súas diferentes funcionalidades",
    "alt_capy": "Captura de pantalla do videoxogo Look for the Capy"
  }
}